<template>
  <div id="agreement" class="page-container kz-background-white">
      <x-header :left-options="{backText: ''}">用户租赁协议</x-header>
      <div class="kz-padding-sm">
          <p>尊敬的用户：<br>
              欢迎您注册成为快租365用户，在注册前请您仔细阅读如下服务条款：<br>
              快租365网站（<span class="kz-text-success">www.kuaizu365.cn</span>，以下简称快租365）通过电子商务的方式为您提供一站式的电脑租赁和IT外包服务；您在注册程序过程中点击“同意条款，立即注册”按钮即表示您与快租365达成协议，本协议即构成对双方有约束力的法律文件。本协议由您与快租365平台运营公司之间就快租365平台（以下简称“平台”）服务等相关事宜所订立的契约，请您仔细阅读本注册协议， 如果同意本协议的条款，请按照页面上的提示完成全部的注册程序。如您终止并退出申请，则视为不接受本协议全部条款。</p>
          <h3>一、总则</h3>
          <p>1.1 快租365按照本协议的规定及其不定时发布的操作规则提供基于互联网和移动互联网的相关服务。</p>

          <p>1.2 为获得服务, 用户应当认真阅读、充分理解本协议中各条款, 包括 免除或者限制快租365责任的免责条款及对用户的权利限制条款。 审慎阅读并选择接受或不接受本协议。</p>

          <p>1.3 快租365有权在必要时修改服务条款，服务条款一旦发生变动，将会以网站公告等方式提示修改的内容， 不再另行通知， 一经快租365公布，则立即自动生效，快租365另有约定的除外。 如果不同意所改动的内容，您可以主动取消获得的平台信息服务。如果您继续享用平台信息服务，则视为接受服务条款的变动。</p>

          <h3>二、用户账号</h3>
          <p>2.1 用户完成注册申请手续后，获得快租365帐号的使用权。用户应提供真实、准确、完整的资料，并不断更新注册信息，符合上述要求。所有原始键入的信息将引用为注册信息。如果因注册信息而引起的问题，并对问题发生所带来的后果，快租365不负任何责任。</p>

          <p>2.2 用户不应将其帐号、密码转让、出售或出借予他人使用，如果快租365发现使用者并非帐号注册者本人，有权停止继续服务。如用户发现其帐号遭他人非法使用，应立即通知快租365。因黑客行为或用户违反本协议规定导致帐号、密码遭他人非法使用的，由用户承担因此导致的损失和一切法律责任，快租365不承担任何责任。

          <p>2.3 对于涉及用户注册信息、个人信息等隐私信息的，将对其中涉及个人隐私信息予以严格保密，除非得到您的授权、或法律另有规定外，快租365不会向外界披露您的隐私信息。

          <p>2.4 由于法律法规的规定、快租365自身必要因素等原因，快租365有权登陆进入注册账户，进行证据保全。 并且有权根据您在平台上申请账户时所填写的信息，向快租365合作的第三方提取您的相关信息。</p>
          <h3>三、使用规则</h3>
          <p>3.1 使用规则以平台上实时公布的使用规则为准。</p>

          <p>3.2 用户在使用平台服务时，应当严格遵守以下义务：</p>

          <p>3.2.1 必须遵循国家的相关法律法规, 不得发布含有中国法律、法规、规章、条例以及任何具有法律效力之规范所限制或禁止的内容，不得发布危害国家安全、色情、暴力等任何合法权利等非法内容;</p>

          <p>3.2.2 不得传输损害国家社会公共利益和涉及国家安全的信息资料；</p>

          <p>3.2.3 不得利用平台从事洗钱、窃取商业秘密、窃取个人信息等违法犯罪活动；</p>

          <p>3.2.4 不得利用在平台注册的账户进行牟利性经营活动；</p>

          <p>3.2.5 不得发布任何侵犯他人著作权、商标权等知识产权或合法权利的内容。</p>

          <p>3.3 用户违反本协议或相关的服务条款的规定，导致或产生的任何第三方主张的任何索赔、要求或损失，包括合理的律师费及其他费用，用户应当赔偿。快租365有权视用户的行为性质，采取包括但不限于删除用户发布信息内容、暂停使用许可、终止服务、限制使用、追究法律责任等措施。</p>

          <h3>四、用户信息查询及报送</h3>

          <p>4.1 除用户提供的及快租365自行合法收集的用户信息外，用户还授权快租365或快租365合作的第三方（下称“第三方”） 通过征信机构或经监管部门或行业自律组织认可的信息平台查询、采集并报送用户的征信信息或其他相关信息。快租365将对通过上述所有方式获取的用户信息按照行业标准惯例以予以保护。</p>

          <p>4.2 用户同意，除法律另有规定之外，基于为用户提供更优质服务之目的，快租365有权在以下情况下合法合理使用用户信息：</p>

          <p>4.2.1 用户授权快租365或第三方根据用户所提供的信息（含征信信息或其他相关信息等）及快租365自行获得的信息评定用户在本服务中所拥有的信用额度；</p>

          <p>4.2.2 在不透露用户隐私的前提下，快租365有权对整个用户数据库进行分析并对用户数据库进行商业上的利用；</p>

          <p>4.2.3 向开展合作的必要第三方提供、查询和收集用户的信息；</p>

          <p>4.2.4 其他基于履行协议、提供服务、解决争议、保障交易安全等目的使用用户信息等。</p>

          <p>4.3 快租365有义务根据有关法律、法规、规章行业自律规范及其他政府规范性文件的要求向司法机关、政府部门、行业自律组织或者其他监管机构提供并报送用户的资料及交易信息等。</p>

          <h3>五、提供服务</h3>

          <p>5.1 快租365提供的具体服务内容以快租365与用户签订的具体协议和平台展示的服务内容信息为准。</p>

          <p>5.2 快租365可根据国家法律法规规章政策变化及维护交易秩序等原因，不定时变更服务内容，变更后的服务内容将通过网站公告等方式告知用户。一经快租365公布，则立即自动生效，快租365另有约定的除外。发生变更后的服务内容仍旧受到本协议的约束。</p>

          <p>5.3 鉴于网络服务的特殊性，用户同意快租365经事先通知，变更、中断或终止部分或全部的网络服务（包括收费网络服务），快租365不担保网络服务不会中断。</p>

          <h3>六、终止服务</h3>

          <p>6.1 您同意快租365基于认为您已经违反本注册协议的条款，终止您的密码、帐号或使用服务（或服务的任何部分），并将您在本服务内任何内容加以移除并删除。您同意依本协议规定，无需进行事先通知即可中断或终止，您承认并同意，快租365可立即关闭或删除您的帐号及您帐号中所有相关信息及文件，及/或禁止继续使用前述文件或本服务。此外，以上责任由您承担。</p>

          <h3>七、免责条款</h3>

          <p>7.1 快租365出现下列任一状况而无法正常运作，致使无法向用户提供本协议项下的各项服务，快租365不承担任何违约或赔偿责任，该状况包括但不限于：</p>

          <p>7.1.1 在服务平台维护期间；</p>

          <p>7.1.2 电信设备出现故障不能进行数据传输的；</p>

          <p>7.1.3 因台风、地震、海啸、洪水、停电、战争、恐怖袭击等不可抗力之因素，造成系统障碍不能执行业务的；</p>

          <p>7.1.4 由于黑客攻击、电信部门和其他快租365有信息技术依赖的相关部门、企事业单位技术调整或故障、网站升级、银行方面的问题等原因而造成的服务中断或者延迟。</p>

          <p>7.2 本协议有效期内，因国家相关主管部门颁布、变更的法令、政策导致快租365不能提供约定服务的，不视为其违约，双方可根据相关的法令、政策变更协议内容或提前终止本协议。</p>

          <p>7.3 快租365有权根据风险及自身业务运营情况需要中止（终止）向用户提供服务，因此导致用户无法使用服务或服务受到限制的，不视为服务提供方违约。</p>

          <h3>八、知识产权</h3>

          <p>8.1 快租365平台上所有内容，包括但不限于著作、图片、档案、资讯、资料、网站架构、网站画面的安排、网页设计，均由本公司或其他权利人依法拥有其知识产权，包括但不限于商标权、专利权、著作权、商业秘密等。</p>

          <p>8.2 非经本公司或其他权利人书面同意，任何人不得擅自使用、修改、复制、公开传播、改变、散布、发行或公开发表本网站程序或内容。</p>

          <h3>九、适用法律及争议解决</h3>

          <p>9.1 本协议的订立、执行和解释及争议的解决均应适用中华人民共和国法律。</p>

          <p>9.2 如双方就本协议内容或其执行发生任何争议，双方应尽量友好协商解决；协商不成时，任何一方均可向快租365所在地的人民法院提起诉讼。</p>

          <p>9.3 快租365有权根据需要不时地修改本协议正文、附件及规则，或制定发布新规则。上述内容都作为本协议的组成部分。</p>

      </div>
  </div>
</template>
<style>
    #agreement p{ padding-bottom: 10px;}
    #agreement h3{ padding-top: 10px;}
</style>
<script>
    import {XHeader} from 'vux';
    export default{
        components:{
            XHeader
        },
        created(){
            this.$store.dispatch('isLoading',false);
        },
    }
</script>
